* Test and develop

#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python*
import UTG900
print( UTG900.version())
#+END_SRC

#+RESULTS:
: Python 3.9.1 | packaged by conda-forge | (default, Jan 10 2021, 02:55:42) 
: [GCC 9.3.0] on linux
: Type "help", "copyright", "credits" or "license" for more information.
: 0.0.5-SNAPSHOT


#+BEGIN_SRC python :eval no-export :results output :noweb no :session *Python*
sgen = UTG900.UTG962()
sgen.list_resources()
#+END_SRC

#+RESULTS:
: WARNING:absl:Successfully connected  'USB0::0x6656::0x0834::1485061822::INSTR' with 'UNI-T Technologies,UTG900,1485061822,1.08'
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/tmp/babel-ZafpdS/python-xPMIfR", line 2, in <module>
:     sgen.list_resources()
:   File "/home/jj/work/UTG900/UTG900/UTG900.py", line 447, in list_resources
:     return self.rm.list_resources()
: AttributeError: 'UTG962' object has no attribute 'rm'


* Delivery                                                 

*Development environment only!!*

** Relaseit

*** Show release status

 #+BEGIN_SRC sh :eval no-export :results output
 releaseit.sh show
 #+END_SRC

 #+RESULTS:
 : /home/jj/bin/releaseit.sh - $Release:0.0.4-SNAPSHOT$
 : ------------------------------------------------------------------
 : PREV_REL=0.0.2 --> REL=0.0.3-SNAPSHOT
 : ------------------------------------------------------------------
 : ## 0.0.3-SNAPSHOT/20210328-23:02:58
 : 
 : - README.org: installation
 : ------------------------------------------------------------------


*** Create release 

 Should not have any files unchecked

 #+BEGIN_SRC sh :eval no-export :results output
 git status
 #+END_SRC

 #+RESULTS:
 : On branch master
 : Your branch is ahead of 'origin/master' by 1 commit.
 :   (use "git push" to publish your local commits)
 : 
 : nothing to commit, working tree clean


 #+BEGIN_SRC sh :eval no-export :results output
 releaseit.sh  create_release commit current VERSION files README.org -  commit tag 2>&1 || true
 #+END_SRC

 #+RESULTS:
 : [master c490f81] ## 0.0.4/20210329-09:06:37
 :  1 file changed, 1 insertion(+), 1 deletion(-)
 : [master b287267] ## 0.0.4/20210329-09:06:37
 :  2 files changed, 2 insertions(+), 2 deletions(-)


** pyinstaller

#+BEGIN_SRC bash :eval no-export :results output
pyinstaller UTG900/UTG900.py --onefile
#+END_SRC

#+RESULTS:


** Install

*** Create =setup.py= package

 #+BEGIN_SRC bash :eval no-export :results output
 cat VERSION
 #+END_SRC

 #+RESULTS:
 : 0.0.5


 Ref: https://packaging.python.org/guides/distributing-packages-using-setuptools/

 #+BEGIN_SRC bash :eval no-export :results output :exports code
 python3 setup.py  sdist  bdist_wheel
 #+END_SRC

 #+RESULTS:
 #+begin_example
 version 0.0.5 , packages ['UTG900']
 running sdist
 running egg_info
 writing utg900.egg-info/PKG-INFO
 writing dependency_links to utg900.egg-info/dependency_links.txt
 writing top-level names to utg900.egg-info/top_level.txt
 reading manifest file 'utg900.egg-info/SOURCES.txt'
 writing manifest file 'utg900.egg-info/SOURCES.txt'
 running check
 creating utg900-0.0.5
 creating utg900-0.0.5/UTG900
 creating utg900-0.0.5/utg900.egg-info
 copying files to utg900-0.0.5...
 copying setup.py -> utg900-0.0.5
 copying UTG900/UTG900.py -> utg900-0.0.5/UTG900
 copying UTG900/__init__.py -> utg900-0.0.5/UTG900
 copying UTG900/../RELEASES.md -> utg900-0.0.5/UTG900/..
 copying UTG900/../VERSION -> utg900-0.0.5/UTG900/..
 copying utg900.egg-info/PKG-INFO -> utg900-0.0.5/utg900.egg-info
 copying utg900.egg-info/SOURCES.txt -> utg900-0.0.5/utg900.egg-info
 copying utg900.egg-info/dependency_links.txt -> utg900-0.0.5/utg900.egg-info
 copying utg900.egg-info/top_level.txt -> utg900-0.0.5/utg900.egg-info
 Writing utg900-0.0.5/setup.cfg
 Creating tar archive
 removing 'utg900-0.0.5' (and everything under it)
 running bdist_wheel
 running build
 running build_py
 copying UTG900/UTG900.py -> build/lib/UTG900
 copying UTG900/../VERSION -> build/lib/UTG900/..
 copying UTG900/../RELEASES.md -> build/lib/UTG900/..
 installing to build/bdist.linux-x86_64/wheel
 running install
 running install_lib
 creating build/bdist.linux-x86_64/wheel
 creating build/bdist.linux-x86_64/wheel/UTG900
 copying build/lib/UTG900/__init__.py -> build/bdist.linux-x86_64/wheel/UTG900
 copying build/lib/UTG900/UTG900.py -> build/bdist.linux-x86_64/wheel/UTG900
 copying build/lib/VERSION -> build/bdist.linux-x86_64/wheel
 copying build/lib/RELEASES.md -> build/bdist.linux-x86_64/wheel
 running install_egg_info
 Copying utg900.egg-info to build/bdist.linux-x86_64/wheel/utg900-0.0.5-py3.9.egg-info
 running install_scripts
 creating build/bdist.linux-x86_64/wheel/utg900-0.0.5.dist-info/WHEEL
 creating 'dist/utg900-0.0.5-py3-none-any.whl' and adding 'build/bdist.linux-x86_64/wheel' to it
 adding 'RELEASES.md'
 adding 'VERSION'
 adding 'UTG900/UTG900.py'
 adding 'UTG900/__init__.py'
 adding 'utg900-0.0.5.dist-info/METADATA'
 adding 'utg900-0.0.5.dist-info/WHEEL'
 adding 'utg900-0.0.5.dist-info/top_level.txt'
 adding 'utg900-0.0.5.dist-info/RECORD'
 removing build/bdist.linux-x86_64/wheel
 #+end_example


*** Install distribution package

 #+BEGIN_SRC bash :eval no-export :results output
 VERSION_FILE=$(ls -1tr dist/*.tar.gz | tail -1| cut -f2)
 echo VERSION_FILE=$VERSION_FILE
 python3 -m pip install --user $VERSION_FILE  && echo installed $VERSION_FILE
 #+END_SRC

 #+RESULTS:
 #+begin_example
 VERSION_FILE=dist/utg900-0.0.5.tar.gz
 Processing ./dist/utg900-0.0.5.tar.gz
 Building wheels for collected packages: utg900
   Building wheel for utg900 (setup.py): started
   Building wheel for utg900 (setup.py): finished with status 'done'
   Created wheel for utg900: filename=utg900-0.0.5-py3-none-any.whl size=8268 sha256=6bd0dbaa94d57a531ee4e35f0e93174a143fd61ab27ddfb0ac7de90a6bb9cde7
   Stored in directory: /home/jj/.cache/pip/wheels/8b/d4/a4/8fa6e2398cb41a464b30a0af64a7b4ccad5af3848dc7edf147
 Successfully built utg900
 Installing collected packages: utg900
   Attempting uninstall: utg900
     Found existing installation: utg900 0.0.5-SNAPSHOT
     Uninstalling utg900-0.0.5-SNAPSHOT:
       Successfully uninstalled utg900-0.0.5-SNAPSHOT
 Successfully installed utg900-0.0.5
 installed dist/utg900-0.0.5.tar.gz
 #+end_example



** Create snapshot

 #+BEGIN_SRC sh :eval no-export :results output
 releaseit.sh  create_snapshot current VERSION files README.org - commit || true
 #+END_SRC

 #+RESULTS:
 : [master eddee62] ## 0.0.6-SNAPSHOT/20210330-10:09:33
 :  3 files changed, 4 insertions(+), 3 deletions(-)




* Fin                                                              :noexport:


** Emacs variables

   #+RESULTS:

   # Local Variables:
   # org-confirm-babel-evaluate: nil
   # End:
   #


